0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 3.339529994716929e-05;

boundaryField
{
    asym1
    {
        type            wedge;
    }
    asym2
    {
        type            wedge;
    }
    inlet
    {
        type            calculated;
        value           uniform 1e-12;
    }
    nozzle
    {
        type            zeroGradient;
    }
    outlet
    {
        type            calculated;
        value           uniform 1e-12;
    }
}

// ************************************************************************* //
